{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 140, 1], "input_dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["input_3", 0, 0]]], "name": "convolution2d_5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "convolution2d_6"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "maxpooling2d_3"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "name": "dropout_3"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "flatten_3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_11", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 28704, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}, "inbound_nodes": [[["flatten_3", 0, 0]]], "name": "dense_11"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_12", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 28704, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}, "inbound_nodes": [[["flatten_3", 0, 0]]], "name": "dense_12"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_13", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 28704, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}, "inbound_nodes": [[["flatten_3", 0, 0]]], "name": "dense_13"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_14", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 28704, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}, "inbound_nodes": [[["flatten_3", 0, 0]]], "name": "dense_14"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_15", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 28704, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}, "inbound_nodes": [[["flatten_3", 0, 0]]], "name": "dense_15"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "num1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dense_11", 0, 0]]], "name": "num1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "num2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dense_12", 0, 0]]], "name": "num2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "num3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dense_13", 0, 0]]], "name": "num3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "num4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dense_14", 0, 0]]], "name": "num4"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "num5", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dense_15", 0, 0]]], "name": "num5"}], "input_layers": [["input_3", 0, 0]], "output_layers": [["num1", 0, 0], ["num2", 0, 0], ["num3", 0, 0], ["num4", 0, 0], ["num5", 0, 0]], "name": "model_3"}}